{
  "title": "إكس-أو الكمية",
  "subtitle": "اختبر قوانين ميكانيكا الكم في لعبة استراتيجية تفاعلية",
  "playerTurn": "دور اللاعب {{player}}",
  "reset": "بداية جديدة",

  "gameBoard": {
    "playerTurn": "حان دور اللاعب {{player}}",
    "squaresSelected": "(اخترت {{count}} من 2 مربع)"
  },

  "navbar": {
    "about": {
      "title": "الحوسبة الكمية",
      "history": "في عام 1982، اقترح الفيزيائي ريتشارد فاينمان بناء حواسيب تعتمد على ميكانيكا الكم بدلاً من الفيزياء الكلاسيكية. أدرك أن محاكاة الأنظمة الكمية على الحواسيب التقليدية صعبة جداً. هذه الفكرة أدت لولادة الحوسبة الكمية.",
      "present": "اليوم، شركات مثل IBM وGoogle وMicrosoft تبني حواسيب كمية حقيقية. في 2019، حققت Google 'التفوق الكمي' - حاسوبها الكمي حل مسألة في 200 ثانية كانت ستستغرق 10,000 سنة على أقوى حاسوب تقليدي.",
      "future": "الحوسبة الكمية ستغير مجالات كثيرة: اكتشاف الأدوية عبر محاكاة الجزيئات، التشفير غير القابل للكسر، خوارزميات ذكاء اصطناعي أسرع، ومسائل التحسين المعقدة.",
      "concepts": "المفاهيم الكمية الأساسية",
      "superposition": "التراكب",
      "superpositionDesc": "البت الكلاسيكي إما 0 أو 1. البت الكمي (كيوبت) يمكن أن يكون 0 و 1 في نفس الوقت. تخيل عملة تدور في الهواء - أثناء دورانها ليست وجه ولا ظهر، بل كلاهما. فقط عندما تقع تصبح واحدة منهما.",
      "entanglement": "التشابك",
      "entanglementDesc": "عندما يتشابك كيوبتان، قياس أحدهما يؤثر فوراً على الآخر مهما كانت المسافة بينهما. أينشتاين سماها 'التأثير الشبحي عن بُعد'. هذا الترابط يسمح للحواسيب الكمية بمعالجة المعلومات المترابطة بكفاءة.",
      "collapse": "الانهيار (القياس)",
      "collapseDesc": "عندما نقيس كيوبت في حالة تراكب، 'ينهار' إلى حالة محددة - إما 0 أو 1. فعل المراقبة يجبر الكيوبت على الاختيار. لهذا تعمل الحواسيب الكمية بشكل مختلف - لا يمكنك فحص النتائج الوسيطة دون تغييرها."
    },
    "howToPlay": {
      "title": "طريقة اللعب",
      "intro": "لعبة XO الكمية تطبق ميكانيكا الكم على اللعبة الكلاسيكية. كل حركة توضح مفاهيم كمية حقيقية.",
      "step1Title": "الخطوة 1: قم بحركة كمية",
      "step1": "اختر مربعين بدلاً من واحد. علامتك تدخل التراكب - توجد في كلا المربعين في نفس الوقت. كل حركة مرقمة (X1، O2، إلخ) وتظهر في كلا المربعين.",
      "step2Title": "الخطوة 2: أنشئ التشابك",
      "step2": "عندما تشترك حركتان في مربع، تصبحان متشابكتين. سترى علامات متعددة في نفس المربع (مثل X1 و O2). هذه الحركات مترابطة الآن - نتيجة إحداهما تؤثر على الأخرى.",
      "step3Title": "الخطوة 3: أطلق الانهيار",
      "step3": "عندما تشكل الحركات المتشابكة دورة (حلقة مغلقة)، يحدث الانهيار. خصم اللاعب الذي أكمل الدورة يختار كيف تنهار الحركات. كل حركة كمية تصبح علامة كلاسيكية في أحد مربعيها.",
      "step4Title": "الخطوة 4: اربح اللعبة",
      "step4": "احصل على ثلاث علامات كلاسيكية في صف (أفقي، عمودي، أو قطري). فقط العلامات المنهارة تُحتسب - الحركات الكمية في التراكب لا تُحتسب للفوز."
    },
    "rules": {
      "title": "قواعد اللعبة",
      "rule1Title": "الحركات الكمية",
      "rule1": "كل حركة يجب أن تختار مربعين بالضبط. علامتك تظهر في كلا المربعين في تراكب.",
      "rule2Title": "التشابك",
      "rule2": "عندما تشترك الحركات في مربع، تصبح متشابكة. نتائجها تصبح مترابطة.",
      "rule3Title": "الدورة والانهيار",
      "rule3": "عندما تشكل الحركات المتشابكة حلقة مغلقة (دورة)، يحدث الانهيار. الخصم يختار من خيارات الانهيار المتاحة.",
      "rule4Title": "الفوز",
      "rule4": "ثلاث علامات كلاسيكية (منهارة) في صف تفوز. العلامات الكمية في التراكب لا تُحتسب.",
      "rule5Title": "القيود",
      "rule5": "لا يمكنك اختيار مربعات فيها علامات كلاسيكية. يمكنك فقط اختيار المربعات الفارغة أو التي فيها حركات كمية."
    }
  },

  "guide": {
    "title": "مرشدك الذكي",
    "moveBadge": "الحركة الحالية:",
    "tip": "نصيحة استراتيجية",
    "next": "الخطوة التالية؟",
    "progress": {
      "step": "الخطوة {{current}} من {{total}}"
    },
    "firstSquare": {
      "title": "دورك يا {{player}}!",
      "action": "ما المطلوب منك الآن:",
      "actionDesc": "اختر المربع الأول الذي تريد وضع علامتك الكمية فيه",
      "why": "لماذا تفعل هذا؟",
      "whyDesc": "علامتك {{moveId}} ستدخل في حالة تراكب كمي مذهلة، ستكون موجودة في مربعين مختلفين في نفس اللحظة! تماماً كما يعمل الكيوبت في الحواسيب الكمية الحقيقية.",
      "next": "بعد اختيار المربع الأول، ستحتاج لاختيار مربع ثانٍ لإكمال حركتك الكمية. فكّر جيداً في موقع المربعين، هل يمكنهما تشكيل خط فوز محتمل؟"
    },
    "secondSquare": {
      "title": "أكمل حركتك يا {{player}}",
      "action": "ما المطلوب منك الآن:",
      "actionDesc": "اختر المربع الثاني لإتمام حركتك الكمية وإدخال علامتك في حالة التراكب",
      "why": "لماذا تفعل هذا؟",
      "whyDesc": "بعد اختيار المربع الثاني، علامتك الكمية ستصبح موجودة فعلياً في كلا المربعين في وقت واحد حتى يحدث الانهيار. هذه هي قوة التراكب الكمي!",
      "tip": "اختر المربع الثاني بحكمة! حاول أن تُنشئ خطوط فوز محتملة مع كلا المربعين. تذكر: يمكنك أيضاً مشاركة مربعات الخصم لخلق تشابك كمي والتحكم في الانهيارات المستقبلية."
    },
    "collapse": {
      "title": "لحظة الانهيار الكمي!",
      "what": "ماذا يحدث الآن؟",
      "whatDesc": "تشكّلت دورة في شبكة التشابكات! هذا يعني أن حلقة مغلقة من الحركات المتشابكة قد اكتملت، ويجب الآن 'قياس' جميع الحالات الكمية المرتبطة بهذه الدورة لتنهار إلى مواقع كلاسيكية محددة.",
      "creator": "اللاعب {{player}} هو من أكمل الدورة بحركته الأخيرة",
      "action": "ما المطلوب منك الآن:",
      "actionDesc": "يا {{player}}، أنت الآن تملك قوة اختيار كيفية انهيار الحالات الكمية! اختر بحكمة، قرارك سيحدد أين ستستقر كل علامة كمية لتصبح علامة كلاسيكية ثابتة.",
      "why": "لماذا يحدث هذا الانهيار؟",
      "whyDesc": "في ميكانيكا الكم الحقيقية، عندما تتشكل دورة من الحالات المتشابكة، يحدث تناقض منطقي يُجبر النظام على الانهيار والاستقرار. هذا يعكس مبدأ 'القياس الكمي' حيث المراقبة تُجبر الجسيمات على اختيار حالة محددة. في لعبتنا، اللاعب الذي لم يُنشئ الدورة يلعب دور 'المراقب' الذي يحدد نتيجة القياس!",
      "optionsTitle": "خيارات الانهيار المتاحة:",
      "optionsDesc": "كل خيار أدناه يمثل طريقة مختلفة يمكن للحركات الكمية أن تنهار بها. ادرس الخيارات جيداً واختر الأنسب لاستراتيجيتك، هل تريد تشكيل خط فوز؟ أم تريد منع خصمك من الفوز؟",
      "option": "الخيار رقم {{number}}",
      "square": "المربع رقم {{number}}",
      "chooseThis": "اختر هذا الانهيار",
      "generating": "جارٍ حساب جميع خيارات الانهيار الممكنة...",
      "chooserNote": "ملاحظة: دائماً اللاعب المقابل لمن أنشأ الدورة هو من يختار كيفية الانهيار، هذا يضيف بُعداً استراتيجياً عميقاً للعبة!",
      "optionsBelow": "اختر من الخيارات أدناه"
    },
    "victory": {
      "title": "فوز مستحق!",
      "player": "اللاعب {{player}} يحقق الانتصار!",
      "explanation": "ثلاث علامات كلاسيكية متتالية في صف واحد! حالات التراكب الكمي انهارت أخيراً لتشكل تكويناً فائزاً. أحسنت اللعب والتفكير الاستراتيجي!",
      "simultaneous": "فوز متزامن!",
      "simultaneousDesc": "كلا اللاعبين حصلا على 3 في صف! الفائز هو صاحب الثلاثية التي تحتوي على الحركة الأقدم.",
      "score": "{{player}}: {{score}} نقطة",
      "scoreHalf": "{{player}}: ½ نقطة",
      "point": "نقطة",
      "earliestMove": "{{player}} يفوز لأن خط فوزه يحتوي على أقدم حركة"
    },
    "draw": {
      "title": "تعادل كمّي!",
      "explanation": "امتلأت اللوحة تماماً دون أن يحقق أي لاعب ثلاث علامات كلاسيكية متتالية. جميع حالات عدم اليقين الكمي تم حلها، لكن التوازن الاستراتيجي بينكما كان مثالياً! لعبة رائعة من الطرفين."
    },
    "controls": {
      "title": "أدوات التحكم",
      "reset": "ابدأ لعبة جديدة",
      "showStats": "اعرض الإحصائيات",
      "hideStats": "أخفِ الإحصائيات"
    },
    "stats": {
      "title": "إحصائيات اللعبة الحالية",
      "totalMoves": "إجمالي الحركات",
      "quantumMoves": "حركات كمية",
      "classicalMoves": "حركات كلاسيكية",
      "entanglements": "حالات تشابك"
    }
  },

  "introBanner": {
    "title": "الحوسبة الكمية: مستقبل التكنولوجيا",
    "description": "الحوسبة الكمية تستغل قوانين ميكانيكا الكم الغريبة، مثل التراكب والتشابك الكمي، لحل مسائل رياضية معقدة يستحيل على الحواسيب التقليدية حلها حتى لو عملت لملايين السنين. إنها ليست مجرد حواسيب أسرع، بل طريقة مختلفة تماماً في معالجة المعلومات!"
  },

  "errors": {
    "serverDown": "فشل الاتصال بالخادم. تأكد من تشغيل الـ Backend",
    "moveFailure": "حدث خطأ في تنفيذ الحركة. حاول مرة أخرى",
    "collapseFailure": "حدث خطأ في الانهيار الكمي. حاول مرة أخرى",
    "resetFailure": "حدث خطأ في إعادة تشغيل اللعبة. حاول مرة أخرى",
    "noSquaresAvailable": "لا توجد مربعات متاحة للحركة الكمية",
    "genericError": "حدث خطأ غير متوقع"
  }
}