{
  "title": "إكس-أو الكمية",
  "subtitle": "اختبر قوانين ميكانيكا الكم في لعبة استراتيجية تفاعلية",
  "playerTurn": "دور اللاعب {{player}}",
  "reset": "بداية جديدة",

  "gameBoard": {
    "playerTurn": "حان دور اللاعب {{player}}",
    "squaresSelected": "(اخترت {{count}} من 2 مربع)"
  },

  "navbar": {
    "about": {
      "title": "الحوسبة الكمية: من النظرية إلى الواقع",
      
      "history": "في عام 1982، اقترح الفيزيائي الشهير ريتشارد فاينمان فكرة ثورية غيرت مسار علوم الحاسوب: بناء حاسوب يعتمد على قوانين ميكانيكا الكم بدلاً من الفيزياء الكلاسيكية. أدرك فاينمان أن محاكاة الأنظمة الكمية على الحواسيب التقليدية أمر شبه مستحيل—فالذرة الواحدة قد تحتاج إلى حاسوب بحجم الكون لمحاكاتها بدقة! من هنا ولدت فكرة الحوسبة الكمية التي نشهد تطبيقاتها اليوم.",
      
      "present": "في عصرنا الحالي، لم تعد الحوسبة الكمية مجرد نظرية على الورق. شركات تقنية عملاقة مثل IBM وGoogle ومايكروسوفت تتسابق لتطوير حواسيب كمية حقيقية. في عام 2019، حققت Google إنجازاً تاريخياً أطلقت عليه 'التفوق الكمي' (Quantum Supremacy)، حيث أنجز حاسوبها الكمي عملية حسابية معقدة في 200 ثانية فقط—وهي عملية كانت ستستغرق 10,000 سنة على أقوى الحواسيب الفائقة التقليدية!",
      
      "future": "المستقبل الذي ترسمه الحوسبة الكمية مبهر حقاً. يتوقع العلماء أن تُحدث ثورة جذرية في مجالات حيوية: اكتشاف الأدوية من خلال محاكاة دقيقة للجزيئات والبروتينات، تطوير أنظمة تشفير غير قابلة للاختراق مطلقاً، تحسين خوارزميات الذكاء الاصطناعي وتعلم الآلة، حل مسائل التحسين المعقدة في اللوجستيات والمالية، والمساهمة في فهم أعمق لتغير المناخ والتنبؤ بالطقس.",
      
      "concepts": "المبادئ الأساسية في ميكانيكا الكم:",
      
      "superposition": "التراكب الكمي (Quantum Superposition)",
      "superpositionDesc": "في عالمنا الكلاسيكي، البِت الحاسوبي إما 0 أو 1—لا خيار ثالث. لكن في العالم الكمي العجيب، الكيوبت (Qubit) يستطيع أن يكون في حالة 0 وحالة 1 في نفس اللحظة! تخيل قطعة نقود معدنية تدور في الهواء—في لحظة الدوران، هي 'صورة' و'كتابة' معاً، ولا تستقر على إحداهما إلا عندما تسقط على الأرض. هذه القدرة المذهلة على التواجد في حالات متعددة في وقت واحد هي السر وراء القوة الحسابية الهائلة للحواسيب الكمية.",
      
      "entanglement": "التشابك الكمي (Quantum Entanglement)",
      "entanglementDesc": "وصفها ألبرت آينشتاين بـ'الفعل الشبحي عن بُعد' (Spooky Action at a Distance) لأنها بدت له غريبة ومستحيلة! عندما يتشابك كيوبتان، تصبح حالة أحدهما مرتبطة ارتباطاً وثيقاً بالآخر، بغض النظر عن المسافة الفاصلة بينهما—حتى لو كانا على طرفي الكون! قياس حالة أحدهما يؤثر فوراً على الآخر. هذا الارتباط الغامض والمحيّر هو أحد أقوى الأدوات في يد الحواسيب الكمية لمعالجة معلومات مترابطة بطرق معقدة.",
      
      "collapse": "الانهيار الكمي (Quantum Collapse)",
      "collapseDesc": "واحدة من أغرب ظواهر ميكانيكا الكم: عندما نحاول 'قياس' أو 'مراقبة' جسيم كمي في حالة تراكب، ينهار فوراً ويستقر على حالة واحدة محددة. مثل قطعة النقود التي كانت تدور وفجأة تستقر على 'صورة' أو 'كتابة'. هذا هو مبدأ هايزنبرغ للشك الشهير: فعل المراقبة والقياس نفسه يغير النتيجة! وهذا ما يجعل برمجة الحواسيب الكمية تحدياً فريداً ومثيراً—فأنت لا تستطيع 'مراقبة' ما يحدث داخلها دون أن تؤثر على النتائج."
    },
    
    "howToPlay": {
      "title": "دليلك الكامل للعب إكس-أو الكمية",
      
      "intro": "انسَ كل ما تعرفه عن لعبة إكس-أو التقليدية! في هذه النسخة الكمية الثورية، قوانين ميكانيكا الكم تنطبق على كل حركة تقوم بها. ستختبر بنفسك طريقة تفكير الفيزيائيين الكميين، وستفهم كيف تعمل الحواسيب الكمية بشكل عملي وممتع.",
      
      "step1Title": "الحركة الأولى: ادخل عالم التراكب الكمي",
      "step1": "في اللعبة الكلاسيكية، تضع علامتك في مربع واحد. أما هنا، فستختار مربعين اثنين! علامتك ستدخل في حالة 'تراكب كمي'—أي أنها ستكون موجودة فعلياً في كلا المربعين في نفس اللحظة. تماماً كما يكون الكيوبت في حالة 0 و1 معاً. حركتك الكمية ستُرقّم (مثلاً X1 أو O2) وستظهر كشارة صغيرة في المربعين اللذين اخترتهما.",
      
      "step2Title": "راقب التشابك يتشكل أمام عينيك",
      "step2": "مع استمرار اللعب وتبادل الحركات بينك وبين خصمك، ستبدأ ظاهرة التشابك الكمي بالظهور. عندما يختار لاعبان مربعاً مشتركاً في حركاتهم، تتشابك هذه الحركات—أي تصبح مرتبطة كمياً. ستلاحظ أن بعض المربعات تحتوي على أكثر من شارة واحدة (مثلاً X1 و O2 معاً)—هذا يعني أن هذه الحركات متشابكة. التشابك يعني أن مصير إحدى الحركات سيؤثر على الأخرى عند الانهيار.",
      
      "step3Title": "لحظة الحقيقة: الانهيار الكمي",
      "step3": "عندما تتشكل 'دورة' في شبكة التشابكات (أي حلقة مغلقة من الحركات المتشابكة مع بعضها)، يحدث الانهيار الكمي الحتمي! الآن يجب 'قياس' جميع الحالات الكمية المتشابكة. اللاعب الذي لم يُكمل الدورة (أي خصم من وضع الحركة الأخيرة التي أغلقت الحلقة) هو من يختار كيف ستنهار هذه الحركات. سيظهر له عدة خيارات ممكنة، كل خيار يحدد أي مربع ستستقر فيه كل حركة كمية لتصبح علامة كلاسيكية ثابتة.",
      
      "step4Title": "طريق الفوز عبر الانهيار",
      "step4": "الهدف النهائي يبقى كما في اللعبة الكلاسيكية: احصل على ثلاث علامات متتالية في صف واحد، عمود واحد، أو قطر واحد. لكن هناك فرق جوهري: فقط العلامات الكلاسيكية (التي انهارت من الحالة الكمية إلى موقع محدد) هي التي تُحتسب للفوز. الحركات التي لا تزال في حالة تراكب كمي لا تُحتسب! هذا يجعل اللعبة أكثر تعقيداً واستراتيجية—فعليك التفكير مسبقاً في كيفية إجبار الانهيارات لصالحك."
    },
    
    "rules": {
      "title": "القواعد التفصيلية: فهم عميق للعبة",
      
      "rule1Title": "قاعدة الحركة الكمية الأساسية",
      "rule1": "كل حركة تقوم بها هي حركة كمية بطبيعتها. يجب—ولا بد—أن تختار بالضبط مربعين اثنين لا أكثر ولا أقل. علامتك (X أو O متبوعة برقم تسلسلي للحركة، مثل X1 أو O2) ستُوضع في كلا المربعين المختارين في حالة تراكب كمي. لا يمكنك كسر هذه القاعدة باختيار مربع واحد فقط، ولا يمكنك اختيار ثلاثة مربعات أو أكثر. هذا يعكس طبيعة الكيوبت الذي يحتاج إلى حالتين للتراكب بينهما.",
      
      "rule2Title": "قاعدة التشابك والارتباط الكمي",
      "rule2": "عندما تشترك حركتان كميتان أو أكثر في نفس المربع، تدخل هذه الحركات في حالة 'تشابك كمي'. التشابك يعني أن مصير إحدى الحركات أصبح مرتبطاً ارتباطاً وثيقاً بمصير الحركات الأخرى المتشابكة معها. إذا انهارت إحداها إلى موقع محدد، فهذا سيؤثر تلقائياً على احتمالات انهيار الحركات الأخرى. هذا المبدأ يعكس بدقة ظاهرة التشابك الكمي الحقيقية التي حيّرت الفيزيائيين لعقود.",
      
      "rule3Title": "قاعدة الدورات وإجبار الانهيار",
      "rule3": "عندما تشكل الحركات المتشابكة 'دورة' أو 'حلقة مغلقة' في شبكة التشابكات (بمعنى أن الحركة A متشابكة مع B، و B متشابكة مع C، و C متشابكة مرة أخرى مع A، مشكلة حلقة)، يحدث انهيار كمي فوري وإجباري. اللاعب الذي لم يُنشئ هذه الدورة (أي خصم من وضع الحركة الأخيرة التي أكملت الحلقة) هو من يختار من بين خيارات الانهيار المتاحة. كل خيار انهيار يوضح بالتحديد أي مربع ستستقر فيه كل حركة كمية لتصبح علامة كلاسيكية ثابتة.",
      
      "rule4Title": "قاعدة الفوز والعلامات الكلاسيكية",
      "rule4": "للفوز في اللعبة، يجب أن تحصل على ثلاث علامات كلاسيكية (أي علامات انهارت من الحالة الكمية وأصبحت في مواقع محددة وثابتة) متتالية في صف واحد، عمود واحد، أو قطر واحد. الحركات التي لا تزال في حالة كمية (تراكب) لا تُعتبر في حساب الفوز مطلقاً. إذا امتلأت جميع المربعات دون أن يحقق أي من اللاعبين ثلاث علامات كلاسيكية متتالية، تنتهي اللعبة بالتعادل—وهو احتمال نادر لكنه ممكن!",
      
      "rule5Title": "قاعدة المنع والمربعات المحظورة",
      "rule5": "لا يمكنك—تحت أي ظرف—اختيار مربع يحتوي بالفعل على علامة كلاسيكية (منهارة ومحددة الموقع). يمكنك فقط اختيار المربعات الفارغة تماماً، أو المربعات التي تحتوي على حركات كمية (لم تنهار بعد). هذه القاعدة تحاكي حقيقة فيزيائية مهمة: القياس الكمي نهائي ولا رجعة فيه—بمجرد أن تنهار الحالة الكمية وتصبح كلاسيكية، لا يمكن إعادتها إلى حالة التراكب الكمي مرة أخرى."
    }
  },

  "guide": {
    "title": "مرشدك الذكي",
    
    "moveBadge": "الحركة الحالية:",
    "tip": "نصيحة استراتيجية",
    "next": "الخطوة التالية؟",
    
    "progress": {
      "step": "الخطوة {{current}} من {{total}}"
    },
    
    "firstSquare": {
      "title": "دورك يا {{player}}!",
      "action": " ما المطلوب منك الآن:",
      "actionDesc": "اختر المربع الأول الذي تريد وضع علامتك الكمية فيه",
      "why": "لماذا تفعل هذا؟",
      "whyDesc": "علامتك {{moveId}} ستدخل في حالة تراكب كمي مذهلة—ستكون موجودة في مربعين مختلفين في نفس اللحظة! تماماً كما يعمل الكيوبت في الحواسيب الكمية الحقيقية.",
      "next": "بعد اختيار المربع الأول، ستحتاج لاختيار مربع ثانٍ لإكمال حركتك الكمية. فكّر جيداً في موقع المربعين—هل يمكنهما تشكيل خط فوز محتمل؟"
    },
    
    "secondSquare": {
      "title": "أكمل حركتك يا {{player}}",
      "action": "ما المطلوب منك الآن:",
      "actionDesc": "اختر المربع الثاني لإتمام حركتك الكمية وإدخال علامتك في حالة التراكب",
      "why": "لماذا تفعل هذا؟",
      "whyDesc": "بعد اختيار المربع الثاني، علامتك الكمية ستصبح موجودة فعلياً في كلا المربعين في وقت واحد حتى يحدث الانهيار. هذه هي قوة التراكب الكمي!",
      "tip": "اختر المربع الثاني بحكمة! حاول أن تُنشئ خطوط فوز محتملة مع كلا المربعين. تذكر: يمكنك أيضاً مشاركة مربعات الخصم لخلق تشابك كمي والتحكم في الانهيارات المستقبلية."
    },
    
    "collapse": {
      "title": "لحظة الانهيار الكمي!",
      "what": "ماذا يحدث الآن؟",
      "whatDesc": "تشكّلت دورة في شبكة التشابكات! هذا يعني أن حلقة مغلقة من الحركات المتشابكة قد اكتملت، ويجب الآن 'قياس' جميع الحالات الكمية المرتبطة بهذه الدورة لتنهار إلى مواقع كلاسيكية محددة.",
      "creator": "اللاعب {{player}} هو من أكمل الدورة بحركته الأخيرة",
      "action": " ما المطلوب منك الآن:",
      "actionDesc": "يا {{player}}، أنت الآن تملك قوة اختيار كيفية انهيار الحالات الكمية! اختر بحكمة—قرارك سيحدد أين ستستقر كل علامة كمية لتصبح علامة كلاسيكية ثابتة.",
      "why": "لماذا يحدث هذا الانهيار؟",
      "whyDesc": "في ميكانيكا الكم الحقيقية، عندما تتشكل دورة من الحالات المتشابكة، يحدث تناقض منطقي يُجبر النظام على الانهيار والاستقرار. هذا يعكس مبدأ 'القياس الكمي' حيث المراقبة تُجبر الجسيمات على اختيار حالة محددة. في لعبتنا، اللاعب الذي لم يُنشئ الدورة يلعب دور 'المراقب' الذي يحدد نتيجة القياس!",
      "optionsTitle": "خيارات الانهيار المتاحة:",
      "optionsDesc": "كل خيار أدناه يمثل طريقة مختلفة يمكن للحركات الكمية أن تنهار بها. ادرس الخيارات جيداً واختر الأنسب لاستراتيجيتك—هل تريد تشكيل خط فوز؟ أم تريد منع خصمك من الفوز؟",
      "option": "الخيار رقم {{number}}",
      "square": "المربع رقم {{number}}",
      "chooseThis": "اختر هذا الانهيار",
      "generating": "جارٍ حساب جميع خيارات الانهيار الممكنة...",
      "chooserNote": "ملاحظة: دائماً اللاعب المقابل لمن أنشأ الدورة هو من يختار كيفية الانهيار—هذا يضيف بُعداً استراتيجياً عميقاً للعبة!"
    },
    
    "victory": {
      "title": " فوز مستحق!",
      "player": "اللاعب {{player}} يحقق الانتصار!",
      "explanation": "ثلاث علامات كلاسيكية متتالية في صف واحد! حالات التراكب الكمي انهارت أخيراً لتشكل تكويناً فائزاً. أحسنت اللعب والتفكير الاستراتيجي!"
    },
    
    "draw": {
      "title": " تعادل كمّي!",
      "explanation": "امتلأت اللوحة تماماً دون أن يحقق أي لاعب ثلاث علامات كلاسيكية متتالية. جميع حالات عدم اليقين الكمي تم حلها، لكن التوازن الاستراتيجي بينكما كان مثالياً! لعبة رائعة من الطرفين."
    },
    
    "controls": {
      "title": "أدوات التحكم",
      "reset": " ابدأ لعبة جديدة",
      "showStats": " اعرض الإحصائيات",
      "hideStats": " أخفِ الإحصائيات"
    },
    
    "stats": {
      "title": "إحصائيات اللعبة الحالية",
      "totalMoves": "إجمالي الحركات",
      "quantumMoves": "حركات كمية",
      "classicalMoves": "حركات كلاسيكية",
      "entanglements": "حالات تشابك"
    }
  },

  "introBanner": {
    "title": "الحوسبة الكمية: مستقبل التكنولوجيا",
    "description": "الحوسبة الكمية تستغل قوانين ميكانيكا الكم الغريبة—مثل التراكب والتشابك الكمي—لحل مسائل رياضية معقدة يستحيل على الحواسيب التقليدية حلها حتى لو عملت لملايين السنين. إنها ليست مجرد حواسيب أسرع، بل طريقة مختلفة تماماً في معالجة المعلومات!"
  }
  ,
  "errors": {
    "serverDown": "فشل الاتصال بالخادم. تأكد من تشغيل الـ Backend",
    "moveFailure": "حدث خطأ في تنفيذ الحركة. حاول مرة أخرى",
    "collapseFailure": "حدث خطأ في الانهيار الكمي. حاول مرة أخرى",
    "resetFailure": "حدث خطأ في إعادة تشغيل اللعبة. حاول مرة أخرى",
    "noSquaresAvailable": "لا توجد مربعات متاحة للحركة الكمية",
    "genericError": "حدث خطأ غير متوقع"
  }
}