{
  "title": "Quantum Tic-Tac-Toe",
  "subtitle": "Experience the Laws of Quantum Mechanics Through Strategic Gameplay",
  "playerTurn": "Player {{player}}'s turn",
  "reset": "Start Fresh",

  "gameBoard": {
    "playerTurn": "It's Player {{player}}'s turn",
    "squaresSelected": "(Selected {{count}} of 2 squares)"
  },

  "navbar": {
    "about": {
      "title": "Quantum Computing",
      "history": "In 1982, physicist Richard Feynman proposed building computers based on quantum mechanics instead of classical physics. He realized that simulating quantum systems on traditional computers was extremely difficult. This idea led to the birth of quantum computing.",
      "present": "Today, companies like IBM, Google, and Microsoft are building real quantum computers. In 2019, Google achieved 'Quantum Supremacy' - their quantum computer solved a problem in 200 seconds that would take a classical supercomputer 10,000 years.",
      "future": "Quantum computing will transform many fields: drug discovery through molecular simulation, unbreakable encryption, faster AI algorithms, and complex optimization problems in logistics and finance.",
      "concepts": "Core Quantum Concepts",
      "superposition": "Superposition",
      "superpositionDesc": "A classical bit is either 0 or 1. A quantum bit (qubit) can be both 0 and 1 at the same time. Think of a spinning coin - while spinning, it's neither heads nor tails, but both. Only when it lands does it become one or the other.",
      "entanglement": "Entanglement",
      "entanglementDesc": "When two qubits become entangled, measuring one instantly affects the other, no matter how far apart they are. Einstein called this 'spooky action at a distance'. This connection allows quantum computers to process correlated information efficiently.",
      "collapse": "Collapse (Measurement)",
      "collapseDesc": "When we measure a qubit in superposition, it 'collapses' into a definite state - either 0 or 1. The act of observation forces the qubit to choose. This is why quantum computers work differently - you cannot check intermediate results without changing them."
    },
    "howToPlay": {
      "title": "How to Play",
      "intro": "Quantum Tic-Tac-Toe applies quantum mechanics to the classic game. Each move demonstrates real quantum concepts.",
      "step1Title": "Step 1: Make a Quantum Move",
      "step1": "Select two squares instead of one. Your mark enters superposition - it exists in both squares simultaneously. Each move is numbered (X1, O2, etc.) and appears in both selected squares.",
      "step2Title": "Step 2: Create Entanglement",
      "step2": "When two moves share a square, they become entangled. You'll see multiple marks in the same square (like X1 and O2). These moves are now connected - the outcome of one affects the other.",
      "step3Title": "Step 3: Trigger Collapse",
      "step3": "When entangled moves form a cycle (a closed loop), collapse is triggered. The opponent of the player who completed the cycle chooses how the moves collapse. Each quantum move becomes a classical mark in one of its two squares.",
      "step4Title": "Step 4: Win the Game",
      "step4": "Get three classical marks in a row (horizontal, vertical, or diagonal). Only collapsed marks count - quantum moves still in superposition don't count toward winning."
    },
    "rules": {
      "title": "Game Rules",
      "rule1Title": "Quantum Moves",
      "rule1": "Every move must select exactly two squares. Your mark appears in both squares in superposition.",
      "rule2Title": "Entanglement",
      "rule2": "When moves share a square, they become entangled. Their outcomes become linked.",
      "rule3Title": "Cycle and Collapse",
      "rule3": "When entangled moves form a closed loop (cycle), collapse occurs. The opponent chooses from available collapse options.",
      "rule4Title": "Winning",
      "rule4": "Three classical (collapsed) marks in a row wins. Quantum marks in superposition don't count.",
      "rule5Title": "Restrictions",
      "rule5": "You cannot select squares with classical marks. You can only select empty squares or squares with quantum moves."
    }
  },

  "guide": {
    "title": "Your Smart Guide",
    "moveBadge": "Current Move:",
    "tip": "Strategic Tip",
    "next": "What's Next?",
    "progress": {
      "step": "Step {{current}} of {{total}}"
    },
    "firstSquare": {
      "title": "Your Turn, {{player}}!",
      "action": "What You Need to Do Now:",
      "actionDesc": "Select the first square where you want to place your quantum mark",
      "why": "Why Are You Doing This?",
      "whyDesc": "Your mark {{moveId}} will enter an amazing quantum superposition state - it will exist in two different squares at the same moment! Just like how qubits work in real quantum computers.",
      "next": "After selecting the first square, you'll need to choose a second square to complete your quantum move. Think carefully about the positions of both squares - can they form a potential winning line?"
    },
    "secondSquare": {
      "title": "Complete Your Move, {{player}}",
      "action": "What You Need to Do Now:",
      "actionDesc": "Select the second square to complete your quantum move and enter your mark into superposition",
      "why": "Why Are You Doing This?",
      "whyDesc": "After selecting the second square, your quantum mark will actually exist in both squares at once until collapse occurs. This is the power of quantum superposition!",
      "tip": "Choose the second square wisely! Try to create potential winning lines with both squares. Remember: you can also share your opponent's squares to create quantum entanglement and control future collapses."
    },
    "collapse": {
      "title": "Quantum Collapse Moment!",
      "what": "What's Happening Now?",
      "whatDesc": "A cycle has formed in the entanglement network! This means a closed loop of entangled moves has been completed, and now all quantum states linked to this cycle must be 'measured' to collapse into definite classical positions.",
      "creator": "Player {{player}} completed the cycle with their last move",
      "action": "What You Need to Do Now:",
      "actionDesc": "{{player}}, you now have the power to choose how the quantum states collapse! Choose wisely - your decision will determine where each quantum mark settles to become a fixed classical mark.",
      "why": "Why Does This Collapse Happen?",
      "whyDesc": "In real quantum mechanics, when a cycle of entangled states forms, a logical paradox occurs that forces the system to collapse and stabilize. This reflects the 'quantum measurement' principle where observation forces particles to choose a definite state. In our game, the player who didn't create the cycle acts as the 'observer' who determines the measurement outcome!",
      "optionsTitle": "Available Collapse Options:",
      "optionsDesc": "Each option below represents a different way the quantum moves can collapse. Study the options carefully and choose what best fits your strategy - do you want to form a winning line? Or do you want to prevent your opponent from winning?",
      "option": "Option {{number}}",
      "square": "Square {{number}}",
      "chooseThis": "Choose This Collapse",
      "generating": "Calculating all possible collapse options...",
      "chooserNote": "Note: The player opposite to whoever created the cycle always chooses how to collapse - this adds deep strategic dimension to the game!",
      "optionsBelow": "Choose from options below"
    },
    "victory": {
      "title": "Well-Deserved Victory!",
      "player": "Player {{player}} Achieves Victory!",
      "explanation": "Three classical marks in a row! The quantum superposition states have finally collapsed to form a winning configuration. Excellent play and strategic thinking!",
      "simultaneous": "Simultaneous Win!",
      "simultaneousDesc": "Both players got 3 in a row! The winner is determined by whose winning line contains the earliest move.",
      "score": "{{player}}: {{score}} point",
      "scoreHalf": "{{player}}: ½ point",
      "point": "point",
      "earliestMove": "{{player}} wins because their winning line contains the earliest move"
    },
    "draw": {
      "title": "Quantum Draw!",
      "explanation": "The board is completely full without either player achieving three consecutive classical marks. All quantum uncertainties have been resolved, but the strategic balance between you was perfect! Amazing game from both sides."
    },
    "controls": {
      "title": "Game Controls",
      "reset": "Start New Game",
      "showStats": "Show Statistics",
      "hideStats": "Hide Statistics"
    },
    "stats": {
      "title": "Current Game Statistics",
      "totalMoves": "Total Moves",
      "quantumMoves": "Quantum Moves",
      "classicalMoves": "Classical Moves",
      "entanglements": "Entanglement States"
    }
  },

  "introBanner": {
    "title": "Quantum Computing: The Future of Technology",
    "description": "Quantum computing exploits the strange laws of quantum mechanics like superposition and quantum entanglement to solve complex mathematical problems that are impossible for traditional computers to solve even if they ran for millions of years. It's not just faster computers, but a completely different way of processing information!"
  },

  "errors": {
    "serverDown": "Connection failed. Make sure Backend is running",
    "moveFailure": "Failed to execute move. Try again",
    "collapseFailure": "Failed to execute collapse. Try again",
    "resetFailure": "Failed to reset game. Try again",
    "noSquaresAvailable": "No squares available for quantum moves",
    "genericError": "An unexpected error occurred"
  }
}